Revit 2026 API

# ScheduleFilterGetElementIdValue Method

---

Gets the filter value for a filter using an ElementId value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GetElementIdValue()
```
```vb
Public Function GetElementIdValue As ElementId
```
```cpp
public:
ElementId^ GetElementIdValue()
```
```fsharp
member GetElementIdValue : unit -> ElementId
```

#### Return Value

ElementId The filter value.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The filter value is not an ElementId. |

#### Reference

ScheduleFilter Class

Autodesk.Revit.DB Namespace